Revit 2027 API
BaseImportOptions.GetLayerSelection Method
 Get all set layers name which user want to import into Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<string> GetLayerSelection()
Public Function GetLayerSelection As ICollection(Of String)
public:
ICollection<String^>^ GetLayerSelection()
member GetLayerSelection : unit -> ICollection<string>
Return Value
ICollection<String>
 The layers' name.
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace